req.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:dpp="http://docs.oasis-open.org/ws-dd/ns/discovery/2008/09"><soap:Header><wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe</wsa:Action><wsa:MessageID>urn:uuid:068e8089-7f32-4738-be23-d85a698dadc9</wsa:MessageID></soap:Header><soap:Body><wsd:Probe><wsd:Types>dpp:DiscoveryProxy</wsd:Types></wsd:Probe></soap:Body></soap:Envelope>